[Cues]
Act_E3_1A_Bathroom_AbstinencePoster_Look01_Max_010="Kate probably won't want to look at these posters when she comes back..."
Act_E3_1A_Bathroom_AbstinencePoster_Look02_Max_010="Nobody can blame this poster for Kate's death..."
Act_E3_1A_Bathroom_CHTaylor_Look01_Max_010="Jeez, Taylor actually seems concerned about Kate..."
Act_E3_1A_Bathroom_CHTaylor_Look02_Max_010="I shouldn't be so damn judgmental. Taylor is obviously upset about Kate..."
Act_E3_1A_Bathroom_Mirror2_Look01_Max_010="I hope Victoria feels particularly shitty about posting that link."
Act_E3_1A_Bathroom_Shower_Look01_Max_010="Urrgh. Cave-Max want to shower, but no time. Must meet Chloe."
Act_E3_1A_Corridor_DanaSlate_Look01_Max_010="Dana's really hurting over this."
Act_E3_1A_Corridor_DeathShrine_Interact01_Max_010="This is my prayer for you, Kate. Bless your gentle soul..."
Act_E3_1A_Corridor_DeathShrine_Look01_Max_010="Kate, I would give up my power if I could have another rewind to save you... I won't rest until we find out the truth... and somebody pays for this."
Act_E3_1A_Corridor_Enter_VoiceOver01_Max_010="Okay, this is scary dark. Let there be—"
Act_E3_1A_Corridor_KateDoor_Look01_Max_010="God, that's like some awful TV crime scene in our dorm."
Act_E3_1A_Corridor_KateDoor_Look02_Max_010="Do they really need that crap on the door? Kate's still alive..."
Act_E3_1A_Corridor_KateSlate_Look01_Max_010="So much hypocrite."
Act_E3_1A_Corridor_MPA_Look01_Max_010="Where the hell are you, Rachel Amber?"
Act_E3_1A_Corridor_MPA_Look02_Max_010="I feel like you're guiding us along... but where?"
Act_E3_1A_Corridor_MPA_Look04_Max_010="Yes, I am going to find you, Rachel... For Chloe and Kate."
Act_E3_1A_Corridor_MaxSlate_Look01_Max_010="I hope Kate finally has her wings now..."
Act_E3_1A_Corridor_MaxSlate_Look02_Max_010="I hope you burn bright again soon, Kate."
Act_E3_1A_Corridor_NathanGraffiti_Look01_Max_010="No way can I clean that shit off. Time to get Samuel DaVinci to repaint..."
Act_E3_1A_Corridor_Poster1_Look01_Max_010="I bet you'll party like it's 1999, assholes."
Act_E3_1A_Corridor_Poster2_Look01_Max_010="The end of the world might be coming before your party..."
Act_E3_1A_Corridor_Scripted2_Max_030="Considering all the crazy shit I've done the past days, sneaking out is nothing."
Act_E3_1A_Corridor_Scripted4_Max_010="I better go meet up with Chloe."
Act_E3_1A_Corridor_Scripted4_Max_020="I have to be extra-crispy careful so I don't get caught outside the dorm this late."
Act_E3_1A_Corridor_Scripted_Max_010="Great, he's actually serious... Now I see that assholes run in the family."
Act_E3_1A_Corridor_Scripted_Max_020="This is disturbing. Yes, I have power but Nathan is out of control..."
Act_E3_1A_Corridor_Scripted_Max_030="Victoria isn't here... Maybe I'll just wait and bide my time... going through her shit."
Act_E3_1A_Corridor_TaylorSlate_Look04_Max_010="Incredible. Taylor is utterly shameless."
Act_E3_1A_Corridor_VictoriaSlate_Look01_Max_010="That's a depressing thought. And it's always about Victoria..."
Act_E3_1A_Corridor_VortexPoster_Look01_Max_010="Yes, the Vortex Club does indeed suck."
Act_E3_1A_Corridor_VortexPoster_Look03_Max_010="First Rachel and now Kate... This is the end of the Vortex Club."
Act_E3_1A_DanaRoom_CHDana_Look01_Max_010="Dana looks so sad, even though she's trying to not show it..."
Act_E3_1A_DanaRoom_CHDana_Look02_Max_010="Dana looks guilty and relieved about Kate... She really does care."
Act_E3_1A_DanaRoom_DanaLaptop_Interact01_Max_010="Awww, Trevor is a sweetie. Good for Dana."
Act_E3_1A_DanaRoom_DanaLaptop_Interact02_Max_010="If Dana talks to Juliet about this... She's going to wish she didn't."
Act_E3_1A_DanaRoom_DanaLaptop_Look01_Max_010="Dana clearly doesn't mind if I peruse her laptop..."
Act_E3_1A_DanaRoom_HalloweenStuff_Max_010="That is so damn cute how much Dana is into this Halloween party."
Act_E3_1A_DanaRoom_LoganNote_Max_010="This is both sad, and pathetic."
Act_E3_1A_MaxRoom_Bed_Look01_Max_010="Jeebus, I am so fricking tired... I sound like a moron... But crime does not delay... I need to stay on top of this investigation..."
Act_E3_1A_MaxRoom_DavidPicture_Look01_Max_010="I'm such an idiot, Kate. I could have shown this to the Principal and busted David... I could have..."
Act_E3_1A_MaxRoom_Drawer01_Look01_Max_010="Kate—I swear that I will use all of my power to find out who really pushed you off that roof..."
Act_E3_1A_MaxRoom_Drawer01_Look02_Max_010="It's amazing how happy Kate looks here compared to today... She was basically pushed up to that roof. And I will use my power to find out why. This has to end."
Act_E3_1A_MaxRoom_Hifi_Interact01_Max_010="I don't think this will give me any cover to sneak out..."
Act_E3_1A_MaxRoom_Hifi_Look01_Max_010="You know you're hurting when you don't give a shit about music."
Act_E3_1A_MaxRoom_Laptop_Interact01_Max_010="Glad the media doesn't waste a second exploiting tragedy. Now Kate's family has to see their daughter's death all over the web like a cat video... and I'm even in this one. That makes me ill."
Act_E3_1A_MaxRoom_Laptop_Interact02_Max_010="Glad the media doesn't waste a second exploiting Kate. Now she has another video of herself all over the web... and even I'm in this one. At least the news didn't mention my name... yet."
Act_E3_1A_MaxRoom_Laptop_Interact03_Max_010="Hmmm. Besides Rachel, it's been a while since anybody vanished from Arcadia Bay... I shouldn't sound so disappointed."
Act_E3_1A_MaxRoom_Laptop_Interact04_Max_010="This is such a moving piece of cut and paste Blackwell bullshit. Nobody here had Kate's back. Too little, too late..."
Act_E3_1A_MaxRoom_Laptop_Interact05_Max_010="Yes, now everybody loves Kate Marsh. They bullied her and now post their feels. Hypocrites."
Act_E3_1A_MaxRoom_Laptop_Interact06_Max_010="I sure hope these people treat her better when she comes back to school... if she does."
Act_E3_1A_MaxRoom_Laptop_Interact07_Max_010="Man, I really turned a molehill into a mountain... I feel bad for Mr. Jefferson about this..."
Act_E3_1A_MaxRoom_Laptop_Interact08_Max_010="Now David will get a taste of public surveillance."
Act_E3_1A_MaxRoom_Laptop_Interact09_Max_010="Either I delete my page or I block everybody. Nowhere to hide these days..."
Act_E3_1A_MaxRoom_Laptop_Look01_Max_010="How did Sherlock Holmes deduce anything without the internet?"
Act_E3_1A_MaxRoom_Mirror_Look01_Max_010="Come on, Max. No more tears. You have to act, not react."
Act_E3_1A_MaxRoom_Mirror_Look02_Max_010="Kate's okay, Max. Take a breath, get your shit together. You have time."
Act_E3_1A_MaxRoom_NathanPhoto_Look01_Max_010="Ew, thanks for the image, Nathan... and everybody here thinks Samuel is a creeper..."
Act_E3_1A_MaxRoom_Plant_Interact01_Max_010="Drink up, my precious..."
Act_E3_1A_MaxRoom_Plant_Look01_Max_010="Poor Lisa. I guess I'm better with people than plants..."
Act_E3_1A_MaxRoom_Plant_Look02_Max_010="Oh noes! I can't even take care of a plant, much less a person... What am I good for?"
Act_E3_1A_MaxRoom_Plant_Look03_Max_010="See Lisa, at least I kept you alive... Guess I'm better with plants than people..."
Act_E3_1A_MaxRoom_Plant_Look04_Max_010="First I save Chloe, then Kate, and now you Lisa. Not a bad record for a week."
Act_E3_1A_MaxRoom_Plant_Look05_Max_010="Oh I'm sorry, Lisa... I save Kate but I drown my own plant..."
Act_E3_1A_MaxRoom_Plant_Look06_Max_010="Sorry Lisa. Too much water. I can't even keep my plant alive, much less Kate..."
Act_E3_1A_MaxRoom_Rabbit_Interact01_Max_010="Are you a hungry bunny? Here, nosh on this..."
Act_E3_1A_MaxRoom_Rabbit_Look01_Max_010="Hey bunny, don't be too bummed but from now on... I'm your new mommy."
Act_E3_1A_MaxRoom_Rabbit_Look02_Max_010="Hey bunny, Kate will be back soon and until then I'll be catering to your every whim."
Act_E3_1A_MaxRoom_Schedule_Look01_Max_010="Let me see which classes I won't be attending this week..."
Act_E3_1A_MaxRoom_Schedule_Look02_Max_010="Pretty hard to focus on my class schedule this week... I wonder why."
Act_E3_1A_MaxRoom_Scripted_Max_010="I still can't stop thinking about Kate... It's like I'm awake in a bad dream..."
Act_E3_1A_MaxRoom_Scripted_Max_020="This sucks, I'm so tired... but I can't stop now."
Act_E3_1A_MaxRoom_Scripted_Max_030="Everybody will be talking about Kate now. Blackwell might as well shut down for the next month."
Act_E3_1A_MaxRoom_Scripted_Max_040="Hello, Dana's door is open. She won't bust me for talking to her."
Act_E3_1A_MaxRoom_Window_Look01_Max_010="There's been so much going on I almost forgot about the eclipse... All this atmospheric action can't be a coincidence... and all roads are leading to my tornado vision..."
Act_E3_1A_VicRoom_Cookies_Look01_Max_010="My cookies? Victoria stole my cookies! Now I can't take them back because she'll know I did it! Victoria is... a cookie monster."
Act_E3_1A_VicRoom_Desk_Interact01_Max_010="I'll title this one, "Portrait de la Assholes.""
Act_E3_1A_VicRoom_Desk_Interact02_Max_010="Whoa, there's Kate, totally high. She looks confused, not like she's partying."
Act_E3_1A_VicRoom_Drawer1_Interact01_Max_010="Here they are getting loaded with Satan..."
Act_E3_1A_VicRoom_Drawer2_Interact01_Max_010="These socks cost more than my wardrobe."
Act_E3_1A_VicRoom_Object01_Interact01_Max_010="Victoria's secret? She's a geek."
Act_E3_1A_VicRoom_Object02_Interact01_Max_010="Victoria is about as "street"... as me. But she really appreciates style."
Act_E3_1A_VicRoom_Poster06_Look01_Max_010="Whoa, I had no idea Victoria's parents owned The Chase Space. Color me impressed."
Act_E3_1A_VicRoom_SchoolBag_Interact01_Max_010="A "unique point of view" is right. Thanks to Courtney Wagner ghostwriting this paper."
Act_E3_1A_VicRoom_Scripted3_Max_020="Since I've crossed the line from snoop to detective, I might as well search for clues about what really happened to Kate at the Vortex Club party."
Act_E3_1A_VicRoom_Scripted3_Max_030="Nothing to see here. I guess I shouldn't be so bummed. Not that Victoria couldn't hide her shit... Man, I'm getting paranoid."
Act_E3_1A_VicRoom_Trash_Interact01_Max_010="That's a lot of bank just to clean paint from a sweater..."
Act_E3_1A_VicRoom_Trash_Interact02_Max_010="Congratulations Max, you're digging through somebody's trash. Hmmm, nice lipstick tube."
Act_E3_1A_VicRoom_VicPicture_Look01_Max_010="Victoria must have her own power if she found time to steal this from my room... Good job."
Act_E3_1A_VicRoom_VictoriaLaptop_Interact01_Max_010="Well, well. Maybe Victoria isn't a monster after all..."
Act_E3_1A_VicRoom_VictoriaLaptop_Interact02_Max_010="Well, well. Victoria and Taylor actually show remorse..."
Act_E3_1A_VicRoom_VictoriaLaptop_Interact03_Max_010="This is like a thread for sociopaths. "Max Crackfield"? Lame. Party on, dudes."
Act_E3_1A_VicRoom_VictoriaLaptop_Look01_Max_010="There has to be some dirt in here on Victoria..."
Act_E3_1A_VicRoom_VictoriaShoes_Look01_Max_010="Those boots are made for walking runways..."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_007="Where did she go?"
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_009="I'm my own person, too. See you later."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_010="You should believe it... She jumped because you and everybody here bullied her."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_011="I can. I just wish I could have stopped her... Are you okay?"
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_012="You should believe it! She almost jumped because you and everybody here bullied her."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_013="I can. I'm just so glad she didn't. Are you okay?"
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_018="Me neither. I didn't think you'd be so upset considering how much shit you and Victoria gave Kate..."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_037="No doubt. See you later."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_040="No doubt. I do hope your mother gets better. Let me know if you need anything."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_041="I won't say a word. I swear to Dog."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_043="I know... Victoria must be upset since I saw her sneaking out of the dorm past curfew..."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_044="As a matter of fact, yes."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_048="Probably to Hell. Well, I have to go crash. It's been a rough day as you know."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Max_052="I'm my own person, too. Let me know if you need anything."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_001="Hey Max... I saw you go up on the roof to try to help Kate... I can't believe she jumped..."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_004="Hey Max... I saw you go up on the roof and save Kate... I can't believe she tried to jump..."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_008="I'm my own person, not Victoria's bitch. Hello, like, she's freaking too. She already broke curfew tonight—shit, I'm not supposed to tell anybody."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_014="I'm just, like, shocked. I've never seen anybody try to kill themselves before..."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_015="What? You're, like, blaming me?"
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_016="I'm just, like, numb. I... I've never seen anybody actually die..."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_017="What? You're, like, blaming me?"
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_019="My lips are, like, sealed. Or Victoria will seal them for me."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_032="I hope I can believe you, Max..."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_036="I believe you, Max. Besides Victoria, you're the only who asked me about my mom in the hospital. That meant a lot to me..."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_038="Thanks... You're, like, weird but pretty cool, Max. Especially after watching you go up on that roof. Victoria is wrong about you. Now I have to be alone for my nightly anxiety attack. Talk to you later..."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_039="I know I can trust you since you were so nice asking about my mom in the hospital, but Victoria will, like, make my life hell if I blab, okay?"
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_045="Then just get out of here. Like, stop fucking with me. I've got my own family shit to deal with. I'm done for the day."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_046="Then just get out of here. Like, stop fucking with me. I already told you that my mom is in the hospital. I'm done for the day."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_047="Oh man, like, you saw her? She was so, like, nervous when she left the dorm... She wouldn't even tell me where she was going."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_049="Victoria was wrong about you. Now I have to be alone for my nightly anxiety attack. Talk to you later..."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_050="Thanks Max... And it was, like, pretty awesome when you went up to the roof to save Kate."
Cue_E3_1A_Bathroom_CHTaylor_Phase01_Taylor_051="Thanks Max. And I hope you're okay too. You were the only one who tried to save Kate."
Cue_E3_1A_Bathroom_CHTaylor_Quick01_Taylor_001="I said I'm, like, done, Max. Please leave me alone."
Cue_E3_1A_Bathroom_CHTaylor_Quick01_Taylor_002="I, like, really do need to get some sleep, Max."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_003="I just can't stop thinking about Kate... and if this is my fault too..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_004="Must be serious to throw yourself off the roof..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_005="Better than Kate. I just can't believe she would even attempt suicide..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_006="Not you, Max, you were close to her..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_012="True... but you're the only one who went up to that roof with Kate."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_014="She definitely deserves a face-punch for pimping that video. I didn't do enough to step up."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_017="She definitely deserves a face-punch for pimping that video. I didn't do enough to step up."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_021="Like, why would I know anything else?"
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_023="So what exactly are you saying, Max?"
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_025="And Max, it's not cool to treat me as if I'm some suspect. I have a fucking headache now, so please let me crash."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_028="Maybe Kate was so ashamed she got wasted on that video... I don't blame her, but it was pretty gross."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_030="Tell that to Victoria and the Vortex Club."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_032="I know—you're a better person than any of us here... Hey Max, I think I need to crash now. I'm just over everything today..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_033="I know—Kate could have blown it off but she was too damn nice and innocent..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_037="No girl, that was not luck. You made a choice to save her—like a superhero!"
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_039="You think this has something to do with Nathan being expelled?"
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_040="I know Jefferson got reamed by the Principal... Do you think they're involved?"
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_041="Do you think David Madsen is involved? He finally got his ass busted too."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_044="I'm getting scared now... But people here are still sneaking out tonight..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_047="Victoria bounced out of here earlier and now you, Sherlock..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Dana_048="Does this have something to do with why you got suspended yesterday? Tell me the truth."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_001="Hey Dana... How are you doing?"
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_002="I knew she was depressed, but I had no idea how bad..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_008="I think we're all responsible for what happened..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_009="Come on, don't blame yourself. There are other people involved. Like Victoria Chase."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_010="Because Victoria was still going to torture Kate with that video."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_011="Come on, don't blame yourself. There are other people involved. Like Victoria Chase."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_015="That's really all you know?"
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_016="Now it's time for serious payback. In other words, revenge."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_022="Kate was serious. But it's not all about that video..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_024="So why do you think she was on the roof in the first place?"
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_026="That was bullshit. Where was everybody else?"
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_027="I was lucky, that's all."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_029="Come on... you really believe that Kate Marsh wanted to get drunk at a Vortex Club party?"
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_031="Yeah, too bad I was the only one."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_034="Dana, there's more to this than just Victoria and the Vortex Club being mean."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_035="You were nice to Kate. That's all she needed from everybody else here."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_036="Doesn't matter now. Kate's dead."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_038="Then maybe it's time to catch the bad guys..."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_042="I'm not sure yet, but I'm on it. Weird shit is going down at Blackwell, and I'm going to find out why."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_043="It's complicated... I don't want to drag you into this, okay? Not yet anyway."
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_045="What? Like who?"
Cue_E3_1A_DanaRoom_CHDana_Phase01_Max_046="Not me. I need a break from today... Get some sleep too, Dana. See you later."
Cue_E3_1A_DanaRoom_CHDana_Quick01_Dana_001="I am wiped out, Max. We'll talk later."
Cue_E3_1A_DanaRoom_DanaCall_Dana_010="Hey Max, come here."
Cue_E3_1A_DanaRoom_DanaCall_Dana_020="Hey, can you come in here for a minute?"
Cue_E3_1A_MaxRoom_MaxWakesUp_Max_010="Kate!"
Cue_E3_1A_MaxRoom_MaxWakesUp_Max_050="I knew Chloe would be all over this... So I better get moving."
